Revit 2027 API
CustomExporter.IsRenderingSupported Method
 Checks if view rendering is currently supported in the running instance of Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsRenderingSupported()
Public Shared Function IsRenderingSupported As Boolean
public:
static bool IsRenderingSupported()
static member IsRenderingSupported : unit -> bool
Return Value
Boolean
 Returns True if rendering is currently supported, False otherwise.
Remarks
 A typical reason for rendering not being enabled is when rendering and material libraries are not currently available in the installed copy of Revit.
See Also
Reference
CustomExporter Class
Autodesk.Revit.DB Namespace